# prompt模板使用Jinja2语法，简单点就是用双大括号代替f-string的单大括号
# 本配置文件支持热加载，修改prompt模板后无需重启服务。


# LLM对话支持的变量：
#   - input: 用户输入内容

# 知识库和搜索引擎对话支持的变量：
#   - context: 从检索结果拼接的知识文本
#   - question: 用户提出的问题

# Agent对话支持的变量：

#   - tools: 可用的工具列表
#   - tool_names: 可用的工具名称列表
#   - history: 用户和Agent的对话历史
#   - input: 用户输入内容
#   - agent_scratchpad: Agent的思维记录

PROMPT_TEMPLATES = {}

PROMPT_TEMPLATES["llm_chat"] = {
    "default": """{{ input }}""",

    "default_test": 
    """
    <指令>
    根据输入内容做出回复，按照以下格式输出：<strong>回答：</strong>xxx
    </指令>
    <输入内容>
    {{ input }}
    </输入内容>
    """,

    "py":
    """
    你是一个聪明的代码助手，请你给我写出简单的py代码。 \n
    {{ input }}
    """
    ,
}

PROMPT_TEMPLATES["llm_abstract"] = {
    # "test1（找不到关键词）":     
    #     """
    #     <指令>请找到本文档最重要的一个关键词。
    #     </指令>
    #     <输入文本>
    #     {{ input }}
    #     </输入文本>
    #     """,
    # "test2（没有字数限制）":     
    #     """
    #     <指令>你是一位软件开发生产安全员，请根据输入的文档，总结出该文档的技术知识，并满足以下要求。
    #     要求：
    #     1.每个技术知识用一到两句话表述。
    #     2.不同技术知识要表述不同内容。
    #     3.技术知识标注序号（如1.），不同技术知识之间空一行。
    #     </指令>
    #     <输入文档>
    #     {{ input }}
    #     </输入文档>
    #     """,
    # "test3(chatglm2不可用，3可以尝试，但技术内容过少)":     
    #     """
    #     <指令>假如你是一位软件架构工程师，软件架构工程师的职责是根据输入的文档，提炼出该文档的技术概要，并提供给公司里的其他人学习参考。
    #     要求：按照以下格式输出：
    #         1.xxx\n
    #         2.xxx\n
    #         ...
    #     </指令>
    #     <输入文档>
    #     {{ input }}
    #     </输入文档>
    #     """,
    # "test4（不稳定，过短）":     
    #     """
    #     <指令>假如你是一位项目经理，你需要根据输入的文档，归纳整理后输出该文档的技术重点，汇报给你的技术专家上司，并满足以下要求。
    #     要求：
    #     1.每个技术重点要表述具体、明确
    #     2.不同技术重点之间不能有语义上的重复。
    #     3.按照以下格式输出：\n
    #         1.xxx\n
    #         2.xxx\n
    #         ...
    #     </指令>
    #     <输入文本>
    #     {{ input }}
    #     </输入文本>
    #     """,
    "test2-b":     
        """
        <指令>你是一位软件开发生产安全员，请根据输入的文档，总结出该文档的技术知识，并满足以下要求。
        要求：
        1.每个技术知识用40-60字表述。
        2.不同技术知识要表述不同内容。
        3.请按照以下格式输出：1.xxx\n\n2.xxx\n\n3.xxx\n\n...
        </指令>
        <输入文档>
        {{ input }}
        </输入文档>
        """,
    # "test2-b-0-1":     
    #     """
    #     <指令>你是一位软件开发生产安全员，请根据输入的文档，总结出该文档的技术知识，并满足以下要求。
    #     要求：
    #     1.每个技术知识用一到两句话表述，需要包含简单解释，不超过60字。
    #     2.不同技术知识要表述不同内容。
    #     3.技术知识标注序号（如1.），不同技术知识之间空一行。
    #     </指令>
    #     <输入文档>
    #     {{ input }}
    #     </输入文档>
    #     """,
    # "test2-b-0-2（长）":     
    #     """
    #     <指令>你是一位软件开发生产安全员，请根据输入的文档，总结出该文档的技术知识，并满足以下要求。
    #     要求：
    #     1.每个技术知识用一到两句话表述，需要包含简单解释，不超过60字。
    #     2.不同技术知识要表述不同内容。
    #     3.按照以下格式输出：
    #         1.xxx\n
    #         2.xxx\n
    #         ...
    #     </指令>
    #     <输入文档>
    #     {{ input }}
    #     </输入文档>
    #     """,
    # "test2-b-x":     
    #     """
    #     <指令>忽略输入文档，请你指出国土面积最大的5个国家
    #     要求：按照以下格式输出：
    #         1.xxx\n
    #         2.xxx\n
    #         ...
    #     </指令>
    #     <输入文档>
    #     {{ input }}
    #     </输入文档>
    #     """,
    # "test2-b-y":     
    #     """
    #     <指令>忽略输入文档，请你指出国土面积最大的5个国家
    #     要求：按照以下格式输出：
    #         1.xxx\r\n
    #         2.xxx\r\n
    #         ...
    #     </指令>
    #     <输入文档>
    #     {{ input }}
    #     </输入文档>
    #     """,

    # "test2-b-1（不稳定，可能过长过短，可能换行不换行）":     
    #     """
    #     <指令>你是一位软件开发生产安全员，请根据输入的文档，总结出该文档的技术知识，并满足以下要求。
    #     要求：
    #     1.每个技术知识用一到两句话表述，不超过60字。
    #     2.不同技术知识要表述不同内容。
    #     3.技术知识标注序号（如1.），每条技术知识单独一行。
    #     </指令>
    #     <输入文档>
    #     {{ input }}
    #     </输入文档>
    #     """,
    # "test2-b-2（回车换行指令无效）":     
    #     """
    #     <指令>你是一位软件开发生产安全员，请根据输入的文档，总结出该文档的技术知识，并满足以下要求。
    #     要求：
    #     1.每个技术知识用一到两句话表述，不超过60字。
    #     2.不同技术知识要表述不同内容。
    #     3.技术知识标注序号（如1.），不同技术知识之间回车换行。
    #     </指令>
    #     <输入文档>
    #     {{ input }}
    #     </输入文档>
    #     """,

    # "test2-b-3（换行存在问题，或出现不符合要求的内容）":     
    #     """
    #     <指令>你是一位软件开发生产安全员，请根据输入的文档，总结出该文档的技术知识，并满足以下要求。
    #     要求：
    #     1.每个技术知识用一到两句话表述，不超过60字。
    #     2.不同技术知识要表述不同内容。
    #     3.按照以下格式输出：
    #         1.xxx\n
    #         2.xxx\n
    #         ...
    #     </指令>
    #     <输入文档>
    #     {{ input }}
    #     </输入文档>
    #     """,

    # "test2-c":     
    #     """
    #     <指令>你是一位软件开发生产安全员，请根据输入的文档，总结出该文档的技术知识，并满足以下要求。
    #     要求：
    #     1.每个技术知识用一到两句话表述，字数为50字左右。
    #     2.不同技术知识要表述不同内容。
    #     3.技术知识标注序号（如1.），不同技术知识之间空一行。
    #     </指令>
    #     <输入文档>
    #     {{ input }}
    #     </输入文档>
    #     """,
    # "test2-d（过长，或出现不符合要求的内容）":     
    #     """
    #     <指令>你是一位软件开发生产安全员，请根据输入的文档，总结出该文档的技术知识，并满足以下要求。
    #     要求：
    #     1.每个技术知识用一到两句话表述，字数为40-50字。
    #     2.不同技术知识要表述不同内容。
    #     3.技术知识标注序号（如1.），不同技术知识之间空一行。
    #     </指令>
    #     <输入文档>
    #     {{ input }}
    #     </输入文档>
    #     """,
    # "test2-e（稍短，或出现不符合要求的内容）":     
    #     """
    #     <指令>你是一位软件开发生产安全员，请根据输入的文档，总结出该文档的技术知识，并满足以下要求。
    #     要求：
    #     1.每个技术知识用一到两句话表述，字数为50字。
    #     2.不同技术知识要表述不同内容。
    #     3.技术知识标注序号（如1.），不同技术知识之间空一行。
    #     </指令>
    #     <输入文档>
    #     {{ input }}
    #     </输入文档>
    #     """
}

PROMPT_TEMPLATES["knowledge_base_chat"] = {
    "default":
        """
        <指令>根据已知信息，简洁和专业的来回答问题。如果无法从中得到答案，请说 “根据已知信息无法回答该问题”，不允许在答案中添加编造成分，答案请使用中文。 </指令>
        <已知信息>{{ context }}</已知信息>、
        <问题>{{ question }}</问题>
        """,
    "caseKL":
        """
        <指令>假如你是一位软件工程架构师，请先判断已知信息是否与问题匹配，若不匹配，请跳过；若匹配，请根据已知信息，简洁和专业的来列出问题的风险点。如果无法从中得到答案，请说 “根据已知信息无法回答该问题”，不允许在答案中添加编造成分，答案请使用中文。
        要求：
        1.每个风险点要表述具体、明确，并举例出已知信息中对应的真实案例。
        2.每个风险点都要对应一个措施。
        3.请按照以下格式输出：
        *风险点：
            1.xxx
            2.xxx
            ...
        *措施：
            1.xxx
            2.xxx
            ...
        </指令>
        <已知信息>{{ context }}</已知信息>、
        <问题>{{ question }}</问题>
        """,
    "caseKL_2":
        """
        <指令>假如你是一位软件开发生产安全员，请根据已知信息中的生产案例，归纳整理后输出答案，并满足以下要求。
        要求：
        1.请先判断已知信息语义上是否有问题中的内容；若有，请根据已知信息，列出生产案例；若没有，或无法从已知信息中得到答案，请说 “未匹配到相关案例”，不允许在答案中编造案例，答案请使用中文。
        2.每个案例都要有问题现象、问题原因与措施，且语句通顺、重点突出。
        3.请按照以下格式输出：
        \n\n**案例**\n\n问题现象:xxx\n\n问题原因:xxx\n\n措施:xxx\n\n**案例**\n\n问题现象:xxx\n\n问题原因:xxx\n\n措施:xxx\n\n
        </指令>
        <已知信息>{{ context }}</已知信息>
        <问题>{{ question }}</问题>
        """
}

PROMPT_TEMPLATES["knowledge_base_chat_once"] = {
    "default":
        """
        <指令>根据已知信息，简洁和专业的来回答问题。如果无法从中得到答案，请说 “根据已知信息无法回答该问题”，不允许在答案中添加编造成分，答案请使用中文。 </指令>
        <已知信息>{{ context }}</已知信息>、
        <问题>{{ question }}</问题>
        """,
    "caseKL":
        """
        <指令>假如你是一位软件工程架构师，请先判断已知信息是否与问题匹配，若不匹配，请跳过；若匹配，请根据已知信息，简洁和专业的来列出问题的风险点。如果无法从中得到答案，请说 “根据已知信息无法回答该问题”，不允许在答案中添加编造成分，答案请使用中文。
        要求：
        1.每个风险点要表述具体、明确，并举例出已知信息中对应的真实案例。
        2.每个风险点都要对应一个措施。
        3.请按照以下格式输出：
        *风险点：
            1.xxx
            2.xxx
            ...
        *措施：
            1.xxx
            2.xxx
            ...
        </指令>
        <已知信息>{{ context }}</已知信息>、
        <问题>{{ question }}</问题>
        """,
    "caseKL_2":
        """
        <指令>假如你是一位软件开发生产安全员，请根据已知信息中的生产案例，归纳整理后输出答案，并满足以下要求。
        要求：
        1.请先判断已知信息语义上是否有问题中的内容；若有，请根据已知信息，列出生产案例；若没有，或无法从已知信息中得到答案，请说 “未匹配到相关案例”，不允许在答案中编造案例，答案请使用中文。
        2.每个案例都要有问题现象、问题原因与措施，且语句通顺、重点突出。
        3.答案另起一行，并按照以下格式输出：
        + 案例1:\n
            问题现象:\n
            问题原因:\n
            措施:\n
        + 案例2:\n
            问题现象:\n
            问题原因:\n
            措施:\n
        </指令>
        <已知信息>{{ context }}</已知信息>
        <问题>{{ question }}</问题>
        """
}

PROMPT_TEMPLATES["search_engine_chat"] = {
    "default":
        """
        <指令>这是我搜索到的互联网信息，请你根据这些信息进行提取并有调理，简洁的回答问题。如果无法从中得到答案，请说 “无法搜索到能回答问题的内容”。 </指令>
        <已知信息>{{ context }}</已知信息>、
        <问题>{{ question }}</问题>
        """,

    "search":
        """
        <指令>根据已知信息，简洁和专业的来回答问题。如果无法从中得到答案，请说 “根据已知信息无法回答该问题”，答案请使用中文。 </指令>
        <已知信息>{{ context }}</已知信息>、
        <问题>{{ question }}</问题>
        """,
}
PROMPT_TEMPLATES["agent_chat"] = {
    "default":
        """
        Answer the following questions as best you can. If it is in order, you can use some tools appropriately.You have access to the following tools:

        {tools}

        Please note that the "知识库查询工具" is information about the "西交利物浦大学" ,and if a question is asked about it, you must answer with the knowledge base，
        Please note that the "天气查询工具" can only be used once since Question begin.

        Use the following format:
        Question: the input question you must answer1
        Thought: you should always think about what to do and what tools to use.
        Action: the action to take, should be one of [{tool_names}]
        Action Input: the input to the action
        Observation: the result of the action
        ... (this Thought/Action/Action Input/Observation can be repeated zero or more times)
        Thought: I now know the final answer
        Final Answer: the final answer to the original input question


        Begin!
        history:
        {history}
        Question: {input}
        Thought: {agent_scratchpad}
        """,
    "ChatGLM":
        """
        请请严格按照提供的思维方式来思考。你的知识不一定正确，所以你一定要用提供的工具来思考，并给出用户答案。
        你有以下工具可以使用:
        {tools}
        ```
        Question: 用户的提问或者观察到的信息，
        Thought: 你应该思考该做什么，是根据工具的结果来回答问题，还是决定使用什么工具。
        Action: 需要使用的工具，应该是在[{tool_names}]中的一个。
        Action Input: 传入工具的内容
        Observation: 工具给出的答案（不是你生成的）
        ... (this Thought/Action/Action Input/Observation can be repeated zero or more times)
        Thought: 通过工具给出的答案，你是否能回答Question。
        Final Answer是你的答案

        现在，我们开始！
        你和用户的历史记录:
        History:
        {history}

        用户开始以提问：
        Question: {input}
        Thought: {agent_scratchpad}

        """,
}
